simulacion/07.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-16 Wed 12:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sistemas complejos</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="/res/org.css"/>
<link rel="stylesheet" type="text/css" href="../res/org.css"/>
</head>
<body>
<div id="content">

<div id="outline-container-org8f77d8f" class="outline-2">
<h2 id="org8f77d8f"><span class="section-number-2">1</span> Sistemas complejos</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org128c693" class="outline-3">
<h3 id="org128c693"><span class="section-number-3">1.1</span> Qué es un sistema complejo?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Los sistemas complejos son redes formadas a partir de un numero de
componentes que interactuan entre si, tipicamente de una forma no lineal. Los
sistemas complejos pueden surgir y evolucionar mediante la
<b>self-organization</b>, de forma tal que no son completamente regulares ni
completamente aleatorios, permitiendo el desarrollo de comportamiento
emergente en una escala macroscopica
</p>

<p>
Por ejemplo:
</p>
<ul class="org-ul">
<li>Sistema climático</li>
<li>Internet</li>
<li>Sistemas económicos</li>
<li>Redes sociales</li>
<li>Ecosistemas biológicos</li>
<li>Poblaciones y enfermedades</li>

<li>Sistemas NO-COMPLEJOS
<ul class="org-ul">
<li>Conjunto de componentes independientes (por ej. Gas ideal)
<ul class="org-ul">
<li>Modelos estadísticos</li>
</ul></li>
<li>Conjunto de componentes fuertemente acoplados (por ej. Cuerpo rígido)
<ul class="org-ul">
<li>Modelos determinísticos</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org18aac7e" class="outline-2">
<h2 id="org18aac7e"><span class="section-number-2">2</span> Sistemas dinámicos</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org553a038" class="outline-3">
<h3 id="org553a038"><span class="section-number-3">2.1</span> Qué es un sistema dinámico?</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Un sistema dinamico es un sistema cuyo estado es especificado unicamente por un
conjunto de variables y cuyo comportamiento es descrito por reglas predefinidas
</p>

<p>
Por ejemplo:
</p>
<ul class="org-ul">
<li>Crecimiento de población</li>
<li>Péndulo</li>
<li>Movimiento de planetas</li>
<li>Sistema financiero</li>
</ul>

<p>
Sistema dinamico de tiempos discretos \(x_t = F(x_{t-1},t)\) Este tipo de modelo
lo llama ecuacion de diferencia, ecuacion de recurrencia o un mapa iterativo (si
no existe \(t\) del lado derecho de la ecuacion).
</p>

<p>
Sistema dinamico de tiempos continuos \(\frac{dx}{dt} = F(x,t)\)
Este tipo de modelo se lo llama ecuacion diferencial.
</p>

<p>
Nota 1: \(x\) es un vector de <b>variables de estado</b> del sistema
</p>

<p>
Nota 2: Estas ecuaciones son de <b>primer orden</b> pero son suficientes para
describir un sistema dinámico de cualquier orden.
</p>
</div>
</div>

<div id="outline-container-org3eebbe5" class="outline-3">
<h3 id="org3eebbe5"><span class="section-number-3">2.2</span> Espacio de Fases</h3>
<div class="outline-text-3" id="text-2-2">
<p>
El <b>espacio de fases</b> es donde viven las <b>variables de estado</b> del sistema.
Cualquier estado del sistema se representa unívocamente por un punto en el
espacio de fases.
</p>

<p>
Un sistema dinámico evoluciona en el tiempo como una <b>trayectoria</b> en el espacio
de fases.
</p>


<p>
diag
</p>
</div>
</div>


<div id="outline-container-orgb0d09c0" class="outline-3">
<h3 id="orgb0d09c0"><span class="section-number-3">2.3</span> Espacio de Fases</h3>
<div class="outline-text-3" id="text-2-3">
<p>
ejercicio
diag
</p>
</div>
</div>

<div id="outline-container-org26553e6" class="outline-3">
<h3 id="org26553e6"><span class="section-number-3">2.4</span> Propiedades del espacio de Fases</h3>
<div class="outline-text-3" id="text-2-4">
<p>
En un <b>sistema deterministico</b>, las <b>trayectorias nunca se bifurcan</b> ya que
no pueden existir múltiples estados futuros a partir de una única condición
inicial.
</p>

<p>
Comportamiento de trayectorias:
</p>
<ul class="org-ul">
<li>Diverger a infinito</li>
<li>Converger a un punto fijo estable (Atractor)</li>
<li>Oscilar alrededor de un punto (ciclo límite) (Atractor)</li>
</ul>

<p>
Cuenca de un atractor: conjunto de puntos en el espacio de fases que llevan a
un atractor
</p>
</div>
</div>

<div id="outline-container-orgeb559dc" class="outline-3">
<h3 id="orgeb559dc"><span class="section-number-3">2.5</span> Atractores, cuencas, puntos fijos inestables y ciclos límite</h3>
<div class="outline-text-3" id="text-2-5">
<p>
diag
</p>

<p>
Atractor (punto fijo estable)
Cuenca de atractor
Punto fijo inestable
Ciclo límite (atractor)
</p>
</div>
</div>

<div id="outline-container-org0c2b961" class="outline-3">
<h3 id="org0c2b961"><span class="section-number-3">2.6</span> Ecuaciones de diferencia (tiempo discreto)</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Los sistemas dinámicos en tiempo discreto son fáciles de entender y simular.
</p>

<p>
Ecuación de diferencia
\[ x_{t+1} = F(x_t,t)\]
</p>


<p>
Serie temporal
\[\{x_0,x_1,x_2,x_3,\dots\} \]
</p>

<dl class="org-dl">
<dt>Sistema lineal</dt><dd>una ecuacion dinamica cuyas reglas involucran solamente una
combinacion lineal de variables de estado (una constante por
una variable, una constante, o su suma).</dd>
<dt>Sistema no lineal</dt><dd>Cualquier otra cosa (ecuacion que involucra cuadrados,
cubos, radicales, funciones trigonometricas, etc, de variables de estado).</dd>

<dt>Sistema autonomo</dt><dd>una ecuacion dinamica cuyas reglas no incluyen el tiempo
\(t\) o ningun otra variable externa de forma explicita.</dd>
<dt>Sistemas no autonomos</dt><dd>una ecuacion dinamica cuyas reglas si incluyen el
tiempo \(t\) u otra variable externa de forma explicita.</dd>

<dt>Sistema de primer orden</dt><dd>una ecuacion de diferencia cuyas reglas involucran
variables de estado del pasado inmediato solamente (en el tiempo \(t-1\)).</dd>
<dt>Sistemas de mayor orden</dt><dd>cualquier otra cosa.</dd>
</dl>
</div>
</div>

<div id="outline-container-org03e6a92" class="outline-3">
<h3 id="org03e6a92"><span class="section-number-3">2.7</span> Ejemplos (1 dimensión)</h3>
<div class="outline-text-3" id="text-2-7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">\(x_t = ax_{t-1}+b\)</td>
<td class="org-left">Lineal</td>
<td class="org-left">Autónomo</td>
<td class="org-left">1er Orden</td>
</tr>

<tr>
<td class="org-left">\(x_t = ax_{t-1}+bx_{t-2}+cx_{t-3}\)</td>
<td class="org-left">Lineal</td>
<td class="org-left">Autónomo</td>
<td class="org-left">3er Orden</td>
</tr>

<tr>
<td class="org-left">\(x_t = ax_{t-1}(1-x_{t-1})\)</td>
<td class="org-left">NO-Lineal</td>
<td class="org-left">Autónomo</td>
<td class="org-left">1er Orden</td>
</tr>

<tr>
<td class="org-left">\(x_t = ax_{t-1}x_{t-2}+bx_{t-3}+\sin t\)</td>
<td class="org-left">NO-Lineal</td>
<td class="org-left">NO-Autónomo</td>
<td class="org-left">3er Orden</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org839c8aa" class="outline-3">
<h3 id="org839c8aa"><span class="section-number-3">2.8</span> Reducción a sistemas autónomos de 1er orden</h3>
<div class="outline-text-3" id="text-2-8">
<p>
Cualquier sistema dinámico puede escribirse como un <b>sistema autónomo de
primer orden</b> definiendo nuevas variables de estado (aumentando la
dimensión).
</p>

<p>
Ejemplo 1: sistema orden 2
</p>

<p>
\(x_t = x_{t-1} + x_{t-2}\) Serie de Fibonacci
</p>

<p>
Nueva variable de estado \(y_t = x_{t-1}
   \longrightarrow \begin{matrix}x_t=x_{t-1} + y_{t-1}
   \\ y_t=x_{t-1}\end{matrix}\) sistema con dos dimensiones
</p>


<p>
Ejemplo 2: sistema NO-autónomo
</p>

<p>
\(x_t = x_{t-1} + t\)
</p>

<p>
Nueva variable de estado (clock) \(z_t = z_{t-1}+1, z_0 = 1
   \longrightarrow \begin{matrix}x_t=x_{t-1} + z_{t-1}
   \\ z_t=z_{t-1}+1\end{matrix}\) Sistema con 2 dimensiones
</p>
</div>
</div>
</div>

<div id="outline-container-org58a40fd" class="outline-2">
<h2 id="org58a40fd"><span class="section-number-2">3</span> Sistemas dinámicos Lineales</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org9d15847" class="outline-3">
<h3 id="org9d15847"><span class="section-number-3">3.1</span> Comportamiento de sistemas lineales (1)</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Las ecuaciones lineales siempre se pueden resolver de forma analitica, en cambio
las ecuaciones no lineales no tienen soluciones analiticas en general
</p>

<p>
\[\mathbf{x}_t = \mathbf{A} \mathbf{x}_{t-1} +\mathbf{b} \quad
   \mathbf{x}_t,\mathbf{x}_{t-1},\mathbf{b} \in \Re^N \quad \mathbf{A} \in
   \Re^{NxN}\]
</p>

<p>
Punto Fijo \(x^*\): Todo punto del espacio de fases en donde el sistema permanece
por siempre, es decir: \(\mathbf{x}_t = \mathbf{x}_{t-1}\)
</p>

<p>
Primer resultado: Existe un único punto fijo en los sistemas lineales y es el
siguiente: \(\mathbf{x}^{*} = -(\mathbf{A} - \mathbf{I})^{-1} \mathbf{b}\),
siempre y cuando exista la inversa de \((\mathbf{A}- \mathbf{I})\).
</p>

<p>
Analizamos el comportamiento en torno al punto fijo \(x^*\).
</p>

<p>
Definimos \(\mathbf{y}_t = \mathbf{x}_t - \mathbf{x}^*\) , entonces
$\mathbf{y}<sub>t</sub> = \mathbf{A}\mathbf{y}<sub>t-1</sub>
</p>

<p>
El estado del sistema luego de \(t\) iteraciones será: \(\mathbf{y}_t =
   \mathbf{A}^t \mathbf{y}_0\)
</p>

<p>
Usando la descomposición en autovalores y autovectores: \(\mathbf{A} =
   \mathbf{U \Lambda U^T}\)
</p>

<p>
\[\mathbf{y}_t = \mathbf{U \Lambda^t U^T y}_0\]
</p>

<p>
Definimos \(\mathbf{u}_t = \mathbf{U}^T \mathbf{y}^t\), entonces finalmente
\(\mathbf{u}_t = \mathbf{\Lambda}^t \mathbf{u}_0\)
</p>
</div>
</div>

<div id="outline-container-org91e5c6a" class="outline-3">
<h3 id="org91e5c6a"><span class="section-number-3">3.2</span> Comportamiento de sistemas lineales (2)</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Resumiendo, tenemos un sistema lineal desacoplado: \(\mathbf{u}_t = \mathbf{\Lambda}^t\mathbf{u}_0\)
</p>

<p>
con \(\mathbf{u}_t = \mathbf{U}^T (\mathbf{x}_t -\mathbf{x}^*)\)
</p>

<p>
diag
</p>

<p>
\(u_{nt} = \lambda_n^t u_{n0}\)
</p>

<ul class="org-ul">
<li>Autovalores reales o complejos \(|\lambda_1|,|\lambda_2|<1\) ATRACTOR (punto
fijo estable)</li>
<li>Autovalores reales o complejos \(|\lambda_1|,|\lambda_2|<1\) REPULSOR (punto
fijo inestable)</li>
<li>Autovalores complejos \(|\lambda_1| = |\lambda_2| = 1\) CICLO LIMITE</li>
<li>Autovalores reales \(|\lambda_1|<1,|\lambda_2|>1\) SADDLE POINT</li>
</ul>
</div>
</div>

<div id="outline-container-orgd1ae767" class="outline-3">
<h3 id="orgd1ae767"><span class="section-number-3">3.3</span> Ejercicio: sistema lineal</h3>
<div class="outline-text-3" id="text-3-3">
<p>
\[x_t = 0.5x_{t-1}+y_{t-1}+0.25\]
\[y_t = -0.5x_{t-1}+y_{t-1}+0.75\]
</p>

<ol class="org-ol">
<li>Determine si existe punto fijo y si es único</li>
<li>Determine el tipo de punto fijo</li>
<li>Simule el sistema partiendo de distintas condiciones iniciales y grafique
las trayectorias en el espacio de fases.</li>
</ol>
</div>
</div>
</div>





<div id="outline-container-org728d25b" class="outline-2">
<h2 id="org728d25b"><span class="section-number-2">4</span> Ejemplos Sistemas Lineales y NO-Lineales</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org8cd7552" class="outline-3">
<h3 id="org8cd7552"><span class="section-number-3">4.1</span> Modelos de crecimiento poblacional</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Crecimiento exponencial: \(x_t = ax_{t-1}\)
</p>

<p>
\(x_t\) : tamaño de población
\(a\) : tasa de crecimiento
</p>

<p>
Ejercicio:
</p>
<ol class="org-ol">
<li>Qué tipo de sistema es?</li>
<li>Encuentre el o los puntos fijos</li>
<li>Clasifique el o los puntos fijos en estables o inestables?</li>
<li>Simule el sistema.</li>
</ol>

<p>
Crecimiento logístico (Convergencia a población límite)
\[x_t = f(x_{t-1})x_{t-1} \text{ con } f(x) = - \frac{a-1}{K}x+a\]
</p>

<p>
Ejercicio:
</p>
<ol class="org-ol">
<li>Qué tipo de sistema es?</li>
<li>Encuentre el o los puntos fijos</li>
<li>Clasifique el o los puntos fijos en estables o inestables?</li>
<li>Simule el sistema.</li>
</ol>
</div>
</div>

<div id="outline-container-org3d296fe" class="outline-3">
<h3 id="org3d296fe"><span class="section-number-3">4.2</span> Modelo predador-presa</h3>
<div class="outline-text-3" id="text-4-2">
<p>
diag
</p>

<p>
\[x_t = x_{t-1}+tx_{t-1}(1-\frac{x_{t-1}}{K})-d_x(y_{t-1})x_{t-1}\]
\[y_t = y_{t-1}-dy_{t-1}+r_y(x_{t-1})y_{t-1}\]
</p>

<p>
\(r\): tasa de crecimiento de presas
\(d_x(y)\): Influencia negativa en presas
\(d\) : tasa de mortalidad de predadores
\(r_y(x)\) : Influencia positiva en predadores
</p>
</div>
</div>

<div id="outline-container-org2b8b99d" class="outline-3">
<h3 id="org2b8b99d"><span class="section-number-3">4.3</span> Modelo predador-presa: simulación</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Influencia negativa en presas
$d<sub>x</sub>(y) = 1-\frac{1}{by+1}
</p>

<p>
Influencia positiva en predadores
\(r_y(x) = cx\)
</p>

<p>
SIMULACION:
diagrama
</p>
</div>
</div>
</div>

<div id="outline-container-org1dffc36" class="outline-2">
<h2 id="org1dffc36"><span class="section-number-2">5</span> Material de Lectura</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Libros (Mínimo):
<ul class="org-ul">
<li>[2] Introduction to the Modeling and Analysis of Complex Systems -
Sayama, Cap 1, 3, 4 y 5.</li>
</ul></li>

<li>Libros (opcional):
<ul class="org-ul">
<li>[1] Introduction to Modeling and Simulation with Matlab and Python -
Gordon and Guilfoos, Cap. 9</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
Last update: 2020-09-16 12:37
</div>
</body>
</html>
